src/cf/Reports/уатПланФактныйАнализРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>уатПланФактныйАнализРаботыТС</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/AccumulationRegisters/уатПланРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатПланРаботыТС</Name>
			<Comment>План работы ТС</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте сценария с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВал</Name>
					<Comment>Сумма НДС в валюте сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в регл. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРазделыПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Comment>Параметр выработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДетализацияПланирования</Name>
					<Comment>Детализация планирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:EnumRef.уатПринадлежностьТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Comment>Маршрут</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура груза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыГНГ</v8:Type>
						<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Comment>Статья</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатФактПоЗаказамНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатФактПоЗаказамНаТС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДетализацияПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:EnumRef.уатПринадлежностьТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыГНГ</v8:Type>
						<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатФактРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатФактРаботыТС</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте сценария с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВал</Name>
					<Comment>Сумма НДС в валюте сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в регл. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРасчетСводныхПараметровВыработки</v8:Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказПеревозчику_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатТТД</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатКорректировкаЗаписейРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатТехнологическийПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСтраховойСертификат_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРазделыПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Comment>Параметр выработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДетализацияПланирования</Name>
					<Comment>Детализация планирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:EnumRef.уатПринадлежностьТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Comment>Маршрут</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура услуги</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Comment>Статья</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Reports/уатПланФактныйАнализРаботыТС/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПользовательскиеНастройки = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	
	Для каждого ТекПользовательскаяНастройка Из ПользовательскиеНастройки Цикл
		
		Если ТекПользовательскаяНастройка.Параметр = Новый ПараметрКомпоновкиДанных("Сценарий") Тогда
			ЗначениеСценария = ТекПользовательскаяНастройка.Значение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗначениеСценария) Тогда
		НаборыДанныхСкд = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных;
		Если ЗначениеСценария.Раздел = Перечисления.уатРазделыПланирования.ЗаказыНаЖДПеревозки Тогда
			НаборыДанныхСкд.НаборДанных1.Запрос  =
			"ВЫБРАТЬ
			|	уатПланРаботыТСОбороты.Организация КАК Организация,
			|	уатПланРаботыТСОбороты.ДетализацияПланирования КАК ДетализацияПланирования,
			|	уатПланРаботыТСОбороты.ПараметрВыработки КАК ПараметрВыработки,
			|	уатПланРаботыТСОбороты.Подразделение КАК Подразделение,
			|	уатПланРаботыТСОбороты.Колонна КАК Колонна,
			|	уатПланРаботыТСОбороты.Контрагент КАК Контрагент,
			|	уатПланРаботыТСОбороты.ВидПеревозки КАК ВидПеревозки,
			|	уатПланРаботыТСОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
			|	уатПланРаботыТСОбороты.НаправлениеПеревозки КАК НаправлениеПеревозки,
			|	уатПланРаботыТСОбороты.Маршрут КАК Маршрут,
			|	уатПланРаботыТСОбороты.КоличествоОборот КАК КоличествоПлан,
			|	0 КАК КоличествоФакт,
			|	-уатПланРаботыТСОбороты.КоличествоОборот КАК Отклонение,
			|	уатПланРаботыТСОбороты.Менеджер КАК Менеджер,
			|	уатПланРаботыТСОбороты.Номенклатура КАК Номенклатура,
			|	уатПланРаботыТСОбороты.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ ВремТаб
			|ИЗ
			|	РегистрНакопления.уатПланРаботыТС.Обороты(
			|			,
			|			,
			|			Регистратор,
			|			Сценарий = &Сценарий
			|				И ПараметрВыработки.ИспользоватьПриПланировании
			|				И ВЫБОР
			|					КОГДА Сценарий.ИспользоватьКраткосрочноеПланирование
			|						ТОГДА Периодичность = Сценарий.ПериодичностьКраткосрочногоПланирования
			|					ИНАЧЕ Периодичность = Сценарий.Периодичность
			|				КОНЕЦ) КАК уатПланРаботыТСОбороты
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	уатФактПоЗаказамНаТСОбороты.Организация,
			|	уатФактПоЗаказамНаТСОбороты.ДетализацияПланирования,
			|	уатФактПоЗаказамНаТСОбороты.ПараметрВыработки,
			|	уатФактПоЗаказамНаТСОбороты.Подразделение,
			|	ЗНАЧЕНИЕ(Справочник.уатКолонны.ПустаяСсылка),
			|	уатФактПоЗаказамНаТСОбороты.Контрагент,
			|	уатФактПоЗаказамНаТСОбороты.ВидПеревозки,
			|	уатФактПоЗаказамНаТСОбороты.ОбъектСтроительства,
			|	уатФактПоЗаказамНаТСОбороты.НаправлениеПеревозки,
			|	уатФактПоЗаказамНаТСОбороты.Маршрут,
			|	0,
			|	уатФактПоЗаказамНаТСОбороты.КоличествоОборот,
			|	уатФактПоЗаказамНаТСОбороты.КоличествоОборот,
			|	уатФактПоЗаказамНаТСОбороты.Менеджер,
			|	уатФактПоЗаказамНаТСОбороты.Номенклатура,
			|	уатФактПоЗаказамНаТСОбороты.Регистратор
			|ИЗ
			|	РегистрНакопления.уатФактПоЗаказамНаТС.Обороты(, , Регистратор, ) КАК уатФактПоЗаказамНаТСОбороты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремТаб.Организация КАК Организация,
			|	ВремТаб.ДетализацияПланирования КАК Детализация,
			|	ВремТаб.ПараметрВыработки КАК ПараметрВыработки,
			|	ВремТаб.Подразделение КАК Подразделение,
			|	ЕСТЬNULL(ВремТаб.Колонна, ЗНАЧЕНИЕ(Справочник.уатКолонны.ПустаяСсылка)) КАК Колонна,
			|	ВремТаб.Контрагент КАК Контрагент,
			|	ВремТаб.ВидПеревозки КАК ВидПеревозки,
			|	ВремТаб.ОбъектСтроительства КАК ОбъектСтроительства,
			|	ВремТаб.НаправлениеПеревозки КАК НаправлениеПеревозки,
			|	ВремТаб.Маршрут КАК Маршрут,
			|	СУММА(ВремТаб.КоличествоПлан) КАК КоличествоПлан,
			|	СУММА(ВремТаб.КоличествоФакт) КАК КоличествоФакт,
			|	СУММА(ВремТаб.Отклонение) КАК Отклонение,
			|	ВремТаб.Менеджер КАК Менеджер,
			|	ВремТаб.Номенклатура КАК Номенклатура,
			|	ВремТаб.Регистратор КАК Регистратор
			|ИЗ
			|	ВремТаб КАК ВремТаб
			|
			|СГРУППИРОВАТЬ ПО
			|	ВремТаб.Организация,
			|	ВремТаб.ДетализацияПланирования,
			|	ВремТаб.ПараметрВыработки,
			|	ВремТаб.Подразделение,
			|	ВремТаб.Колонна,
			|	ВремТаб.Контрагент,
			|	ВремТаб.ВидПеревозки,
			|	ВремТаб.ОбъектСтроительства,
			|	ВремТаб.НаправлениеПеревозки,
			|	ВремТаб.Маршрут,
			|	ВремТаб.Менеджер,
			|	ВремТаб.Номенклатура,
			|	ВремТаб.Регистратор";
		Иначе
			НаборыДанныхСкд.НаборДанных1.Запрос  =
			"ВЫБРАТЬ
			|	уатПланРаботыТСОбороты.Организация КАК Организация,
			|	уатПланРаботыТСОбороты.ДетализацияПланирования КАК ДетализацияПланирования,
			|	уатПланРаботыТСОбороты.ПараметрВыработки КАК ПараметрВыработки,
			|	уатПланРаботыТСОбороты.Подразделение КАК Подразделение,
			|	уатПланРаботыТСОбороты.Колонна КАК Колонна,
			|	уатПланРаботыТСОбороты.Контрагент КАК Контрагент,
			|	уатПланРаботыТСОбороты.ВидПеревозки КАК ВидПеревозки,
			|	уатПланРаботыТСОбороты.ОбъектСтроительства КАК ОбъектСтроительства,
			|	уатПланРаботыТСОбороты.НаправлениеПеревозки КАК НаправлениеПеревозки,
			|	уатПланРаботыТСОбороты.Маршрут КАК Маршрут,
			|	уатПланРаботыТСОбороты.КоличествоОборот КАК КоличествоПлан,
			|	0 КАК КоличествоФакт,
			|	-уатПланРаботыТСОбороты.КоличествоОборот КАК Отклонение,
			|	уатПланРаботыТСОбороты.Регистратор КАК Регистратор,
			|	уатПланРаботыТСОбороты.Менеджер КАК Менеджер,
			|	уатПланРаботыТСОбороты.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВремТаб
			|ИЗ
			|	РегистрНакопления.уатПланРаботыТС.Обороты(
			|			,
			|			,
			|			Регистратор,
			|			Сценарий = &Сценарий
			|				И ПараметрВыработки.ИспользоватьПриПланировании
			|				И ВЫБОР
			|					КОГДА Сценарий.ИспользоватьКраткосрочноеПланирование
			|						ТОГДА Периодичность = Сценарий.ПериодичностьКраткосрочногоПланирования
			|					ИНАЧЕ Периодичность = Сценарий.Периодичность
			|				КОНЕЦ) КАК уатПланРаботыТСОбороты
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	уатФактРаботыТСОбороты.Организация,
			|	уатФактРаботыТСОбороты.ДетализацияПланирования,
			|	уатФактРаботыТСОбороты.ПараметрВыработки,
			|	уатФактРаботыТСОбороты.Подразделение,
			|	уатФактРаботыТСОбороты.Колонна,
			|	уатФактРаботыТСОбороты.Контрагент,
			|	уатФактРаботыТСОбороты.ВидПеревозки,
			|	уатФактРаботыТСОбороты.ОбъектСтроительства,
			|	уатФактРаботыТСОбороты.НаправлениеПеревозки,
			|	уатФактРаботыТСОбороты.Маршрут,
			|	0,
			|	уатФактРаботыТСОбороты.КоличествоОборот,
			|	уатФактРаботыТСОбороты.КоличествоОборот,
			|	уатФактРаботыТСОбороты.Регистратор,
			|	уатФактРаботыТСОбороты.Менеджер,
			|	уатФактРаботыТСОбороты.Номенклатура
			|ИЗ
			|	РегистрНакопления.уатФактРаботыТС.Обороты(, , Регистратор, ПараметрВыработки.ИспользоватьПриПланировании) КАК уатФактРаботыТСОбороты
			|ГДЕ
			|	уатФактРаботыТСОбороты.Регистратор.Сценарий = &Сценарий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремТаб.Организация КАК Организация,
			|	ВремТаб.ДетализацияПланирования КАК Детализация,
			|	ВремТаб.ПараметрВыработки КАК ПараметрВыработки,
			|	ВремТаб.Подразделение КАК Подразделение,
			|	ВремТаб.Колонна КАК Колонна,
			|	ВремТаб.Контрагент КАК Контрагент,
			|	ВремТаб.ВидПеревозки КАК ВидПеревозки,
			|	ВремТаб.ОбъектСтроительства КАК ОбъектСтроительства,
			|	ВремТаб.НаправлениеПеревозки КАК НаправлениеПеревозки,
			|	ВремТаб.Маршрут КАК Маршрут,
			|	СУММА(ВремТаб.КоличествоПлан) КАК КоличествоПлан,
			|	СУММА(ВремТаб.КоличествоФакт) КАК КоличествоФакт,
			|	СУММА(ВремТаб.Отклонение) КАК Отклонение,
			|	ВремТаб.Регистратор КАК Регистратор,
			|	ВремТаб.Менеджер КАК Менеджер,
			|	ВремТаб.Номенклатура КАК Номенклатура
			|ИЗ
			|	ВремТаб КАК ВремТаб
			|
			|СГРУППИРОВАТЬ ПО
			|	ВремТаб.Организация,
			|	ВремТаб.ДетализацияПланирования,
			|	ВремТаб.ПараметрВыработки,
			|	ВремТаб.Подразделение,
			|	ВремТаб.Колонна,
			|	ВремТаб.Контрагент,
			|	ВремТаб.ВидПеревозки,
			|	ВремТаб.ОбъектСтроительства,
			|	ВремТаб.НаправлениеПеревозки,
			|	ВремТаб.Маршрут,
			|	ВремТаб.Регистратор,
			|	ВремТаб.Менеджер,
			|	ВремТаб.Номенклатура";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
